unit UnUnicodeEscUtils;

interface

uses
  Windows, Classes;

type
  TUnicodeEscapeString = String;

function UnicodeEscToString(AUEStr: TUnicodeEscapeString): String;

implementation

uses StrUtils;

const
  cUnicodeEscCharList : array[$40..$4F, $0..$F] of Char = (
    {           0    1    2    3    4    5    6    7    8    9    A    B    C    D    E    F   }
    {U+040x}  ('?', '¨', '€', '', 'ª', '½', '²', '¯', '£', 'Š', 'Œ', '', '', '?', '¡', ''),
    {U+041x}  ('À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'Ç', 'È', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î', 'Ï'),
    {U+042x}  ('Ğ', 'Ñ', 'Ò', 'Ó', 'Ô', 'Õ', 'Ö', '×', 'Ø', 'Ù', 'Ú', 'Û', 'Ü', 'İ', 'Ş', 'ß'),
    {U+043x}  ('à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ç', 'è', 'é', 'ê', 'ë', 'ì', 'í', 'î', 'ï'),
    {U+044x}  ('ğ', 'ñ', 'ò', 'ó', 'ô', 'õ', 'ö', '÷', 'ø', 'ù', 'ú', 'û', 'ü', 'ı', 'ş', 'ÿ'),
    {U+045x}  ('?', '¸', '', 'ƒ', 'º', '¾', '³', '¿', '¼', 'š', 'œ', '', '', '?', '¢', 'Ÿ'),
    {U+046x}  ('?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?'),
    {U+047x}  ('?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?'),
    {U+048x}  ('?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?'),
    {U+049x}  ('¥', '´', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?'),
    {U+04Ax}  ('?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?'),
    {U+04Bx}  ('?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?'),
    {U+04Cx}  ('?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?'),
    {U+04Dx}  ('?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?'),
    {U+04Ex}  ('?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?'),
    {U+04Fx}  ('?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?', '?')
  );

function UnicodeEscToString(AUEStr: TUnicodeEscapeString): String;
var
  lInputStr : String;
  lPosUEChar : Integer;
  lPredPos : Integer;
begin
  Result := '';
  lInputStr := AUEStr;
  lPosUEChar := PosEx('\u0', lInputStr);
  if lPosUEChar>0 then
    begin
      while Length(lInputStr)>0 do ;
    end;
end;

end.
